/******************************************************************************
 *
 *   Copyright (C) Initio Corporation 2009-2013, All Rights Reserved
 *
 *   This file contains confidential and propietary information
 *   which is the property of Initio Corporation.
 *
 *
 *
 *****************************************************************************
 * 
 * 3610		2010/04/09	Odin	Initial version
 * 3610		2010/04/27	Odin	USB2.0 BOT Debugging,
 *									we must replace the address pointer into struct
 * 3607		2010/10/06	Ted		Add Chip Revision, Chip VBUS
 *									VBUS detect use GPIO2/Chip VBUS
 * 3607		2010/11/15	Odin		Add USB2_PLL_FREERUN define for fast_hdd
 * 3607		2010/11/20	Odin		AES function
 *
 *****************************************************************************/

#ifndef INI3609_H
#define INI3609_H

sfr SCTXT_INDEX			= 0xF1; 
sfr SCM_INDEX			= 0xF2; 

sfr XTIMER_CTRL			= 0xF3; 
	#define xtimer_disable()		XTIMER_CTRL = 0

//F4h-F7h: These four bytes will hold the CPU Read Cache.
//Each time a byte is read from the external register space
// (not including Instructions) the four bytes are stored little endian in F4h-F7h
sfr CACHE_BYTE0			= 0xF4; 
sfr CACHE_BYTE1			= 0xF5; 
sfr CACHE_BYTE2			= 0xF6; 
sfr CACHE_BYTE3			= 0xF7; 

sfr SCTXT_Flag			= 0xE8;

	#define SCTXT_FLAG_NO_DATA		BIT_7			// 1 : no Data xfer
	#define SCTXT_FLAG_DIN			BIT_6			// 1 : Data-in

#define led0_ctrl			((U8 volatile xdata *)(PERIPH_BASE_ADDR + 0x186))
	#define LED_ENABLE			B_BIT_23
	#define LED_PWM_MODE		B_BIT_22
 	#define LED_FOREVER			B_BIT_21  //
	#define	LED_DIR_DIM			B_BIT_20
	//#define LED_STEP			B_BIT_19|B_BIT_18
	#define LED_SING_DIR		B_BIT_19
	#define LED_BI_DIR			B_BIT_18
	#define LED_POLARITY		B_BIT_17

#define led0_IntStatus		((u8 volatile xdata *)(PERIPH_BASE_ADDR + 0x188))
	#define LED_DONE			B_BIT_0

#define led0_IntEn			((u8 volatile xdata *)(PERIPH_BASE_ADDR + 0x189))
	#define	led0_IntrDisable()	(*led0_IntEn = 0)
	#define	led0_IntrEnable()	(*led0_IntEn = LED_DONE)

/*
// ==============================================
// blinking mode setting:
#define		Blinking_ctrl0	0x00ff0053
#define		Blinking_ctrl1	0x0080ff00

// pwm
#define		PWM_ctrl0	0x0f100010
#define		PWM_ctrl1	0x00f2ff00
*/

////////////////////////////////////////////////////////////////////////////////////
//		Peripheral Interrupt Registers (200h)
////////////////////////////////////////////////////////////////////////////////////
#define periph_IntStatus_0	((u8 volatile xdata *)(PERIPH_BASE_ADDR + 0x200))
	//#define 	GSPI0_INT		B_BIT_4
	//#define 	UART0_INT		B_BIT_0

#define periph_IntStatus_1	((u8 volatile xdata *)(PERIPH_BASE_ADDR + 0x201))
	#define 	SFLASH_INT		B_BIT_15
	#define 	GPIO_I1_INT		B_BIT_13
	#define 	GPIO_I0_INT		B_BIT_12
	#define 	I2C0_INT		B_BIT_8

#define periph_IntStatus_2	((u8 volatile xdata *)(PERIPH_BASE_ADDR + 0x202))
	#define 	LED0_INT		B_BIT_16


#define periph_IntEn_0		((u8 volatile xdata *)(PERIPH_BASE_ADDR + 0x204))
#define periph_IntEn_1		((u8 volatile xdata *)(PERIPH_BASE_ADDR + 0x205))
#define periph_IntEn_2		((u8 volatile xdata *)(PERIPH_BASE_ADDR + 0x206))

#define Periph_Db_Timing_0	((u8 volatile xdata *)(PERIPH_BASE_ADDR + 0x208))
#define Periph_Db_Timing_1	((u8 volatile xdata *)(PERIPH_BASE_ADDR + 0x209))
#define Periph_Db_Timing_2	((u8 volatile xdata *)(PERIPH_BASE_ADDR + 0x20A))
#define Periph_Db_Timing_3	((u8 volatile xdata *)(PERIPH_BASE_ADDR + 0x20B))

// ++++++++++++++++++++++++++++++++++++++++++++++ //
// +++++++++ Peripheral CRC-16 Registers ++++++++ //
// ++++++++++++++++++++++++++++++++++++++++++++++ //
#define CRC_CTRL			(PERIPH_BASE_ADDR + 0x210)
#define crc_ctrl_0			((u8 volatile xdata *)(CRC_CTRL))
	#define	CRC_EN				BIT_0

#define CRC_DATA			(PERIPH_BASE_ADDR + 0x214)
#define crc_data_0			((u8 volatile xdata *)(CRC_DATA))
#define crc_data_1			((u8 volatile xdata *)(CRC_DATA + 1))
#define crc_data_2			((u8 volatile xdata *)(CRC_DATA + 2))
#define crc_data_3			((u8 volatile xdata *)(CRC_DATA + 3))

/****************************************************************************/
/********                                                            ********/
/********    Tx Data Buffer Registers:							     ********/
/********                                                            ********/
/****************************************************************************/
typedef struct _DBUF_SEG {
	u8	dbuf_Seg_ADDR_0;			// 0x0
	u8	dbuf_Seg_ADDR_1;			// 0x1
	u8	dbuf_Seg_ADDR_2;			// 0x2
	u8	dbuf_Seg_ADDR_3;			// 0x3
	u8	dbuf_Seg_InOut;				// 0x4
	u8	dbuf_Seg_OUT;				// 0x5
	u8	dbuf_Seg_Size;				// 0x6
	u8	dbuf_Seg_Control;			// 0x7
} DBUF_SEG, *PDBUF_SEG;

//dbuf_Seg_Control
	#define 	SEG_VALID				B_BIT_7
	#define 	SEG_EMPTY				B_BIT_6
	#define 	SEG_OUT1_SDONE			B_BIT_5
	#define 	SEG_OUT0_SDONE			B_BIT_4
	#define 	SEG_IN_SDONE			B_BIT_3
	#define 	SEG_SEL_OUT_CNT			B_BIT_2
	#define 	SEG_DONE				B_BIT_1
	#define 	SEG_RESET				B_BIT_0

typedef struct _DBUF_PORT {

	u8 dbuf_Port_Addr_0;		// 0x0
	u8 dbuf_Port_Addr_1;		// 0x1
	u8 dbuf_Port_Addr_2;		// 0x2
	u8 dbuf_Port_Addr_3;		// 0x3
	u8 dbuf_Port_Count_0;		// 0x4
	u8 dbuf_Port_Count_1;		// 0x5
	u8 dbuf_Port_Count_2;		// 0x6
	u8 dbuf_Port_Count_3;		// 0x7

} DBUF_PORT, *PDBUF_PORT;


//#define dbuf_Seg				((DBUF_SEG volatile xdata *)(TX_DBUF_ADDR + 0x000))
//extern DBUF_SEG volatile xdata dbuf_Seg[];

#define dbuf_BufferSize			((u8 volatile xdata *)(TX_DBUF_ADDR + 0x080))


#define	dbuf_BufferStatus		((u8 volatile xdata *)(TX_DBUF_ADDR + 0x081)) 
#define	dbuf_SegmentStatus		((u8 volatile xdata *)(TX_DBUF_ADDR + 0x082)) 
#define	dbuf_PortStatus			((u8 volatile xdata *)(TX_DBUF_ADDR + 0x083)) 

#define	dbuf_DataPort			((u8 volatile xdata *)(TX_DBUF_ADDR + 0x084)) 

#define dbuf_Thresh				((u8 volatile xdata *)(TX_DBUF_ADDR + 0x088)) 
#define	dbuf_IntStatus			((u8 volatile xdata *)(TX_DBUF_ADDR + 0x08A)) 
#define	dbuf_IntEn				((u8 volatile xdata *)(TX_DBUF_ADDR + 0x08B)) 

#define	dbuf_PerrAddr_0			((u8 volatile xdata *)(TX_DBUF_ADDR + 0x08C)) 
#define	dbuf_PerrAddr_1			((u8 volatile xdata *)(TX_DBUF_ADDR + 0x08D)) 
